Step_3_scripts_and_AMR/USP_induction_port_AMR/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



#includeFunc probes
(
    name=probes,
    points=
    (
        (0 0.04 0)
        (0 0 0)
        (0 0 -0.025)
    ),
    p, U
)


// ************************************************************************* //
